{
    "@odata.type":  "#microsoft.graph.windowsIdentityProtectionConfiguration",
    "id":  "c849d28e-bc0b-4b49-8ceb-bade52beef87",
    "lastModifiedDateTime":  "2022-07-13T12:17:18.9386037Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-07-23T06:41:30.8006155Z",
    "description":  null,
    "displayName":  "Harden365 - System - Hello Entreprise",
    "version":  2,
    "useSecurityKeyForSignin":  true,
    "enhancedAntiSpoofingForFacialFeaturesEnabled":  false,
    "pinMinimumLength":  4,
    "pinMaximumLength":  12,
    "pinUppercaseCharactersUsage":  "allowed",
    "pinLowercaseCharactersUsage":  "allowed",
    "pinSpecialCharactersUsage":  "allowed",
    "pinExpirationInDays":  null,
    "pinPreviousBlockCount":  null,
    "pinRecoveryEnabled":  true,
    "securityDeviceRequired":  false,
    "unlockWithBiometricsEnabled":  true,
    "useCertificatesForOnPremisesAuthEnabled":  false,
    "windowsHelloForBusinessBlocked":  false
}
