{
  "@odata.type": "#microsoft.graph.macOSExtensionsConfiguration",
  "id": "74f58ebc-465d-4d01-a317-e555a0514559",
  "lastModifiedDateTime": "2022-09-22T12:12:30.8633198Z",
  "roleScopeTagIds": ["0"],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime": "2022-09-22T12:08:56.6507397Z",
  "description": null,
  "displayName": "MacOS - Defender System Extensions",
  "version": 2,
  "kernelExtensionOverridesAllowed": false,
  "kernelExtensionAllowedTeamIdentifiers": [],
  "systemExtensionsBlockOverride": false,
  "systemExtensionsAllowedTeamIdentifiers": [],
  "kernelExtensionsAllowed": [],
  "systemExtensionsAllowed": [
    {
      "teamIdentifier": "UBF8T346G9",
      "bundleId": "com.microsoft.wdav.epsext"
    },
    {
      "teamIdentifier": "UBF8T346G9",
      "bundleId": "com.microsoft.wdav.netext"
    }
  ],
  "systemExtensionsAllowedTypes": []
}
