{
    "@odata.type":  "#microsoft.graph.macOSGeneralDeviceConfiguration",
    "id":  "37e5b90b-fa40-4978-9d62-b1a0d9d53576",
    "lastModifiedDateTime":  "2022-09-22T12:12:47.8952543Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2022-09-22T12:08:57.2418722Z",
    "description":  null,
    "displayName":  "MacOS - Passcode Policy",
    "version":  2,
    "compliantAppListType":  "none",
    "emailInDomainSuffixes":  [

                              ],
    "passwordBlockSimple":  false,
    "passwordExpirationDays":  90,
    "passwordMinimumCharacterSetCount":  null,
    "passwordMinimumLength":  15,
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  null,
    "passwordPreviousPasswordBlockCount":  24,
    "passwordRequiredType":  "alphanumeric",
    "passwordRequired":  true,
    "passwordMaximumAttemptCount":  5,
    "passwordMinutesUntilFailedLoginReset":  null,
    "keychainBlockCloudSync":  false,
    "safariBlockAutofill":  false,
    "cameraBlocked":  false,
    "iTunesBlockMusicService":  false,
    "spotlightBlockInternetResults":  false,
    "keyboardBlockDictation":  false,
    "definitionLookupBlocked":  false,
    "appleWatchBlockAutoUnlock":  false,
    "iTunesBlockFileSharing":  false,
    "iCloudBlockDocumentSync":  false,
    "iCloudBlockMail":  false,
    "iCloudBlockAddressBook":  false,
    "iCloudBlockCalendar":  false,
    "iCloudBlockReminders":  false,
    "iCloudBlockBookmarks":  false,
    "iCloudBlockNotes":  false,
    "airDropBlocked":  false,
    "passwordBlockModification":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockAutoFill":  false,
    "passwordBlockProximityRequests":  false,
    "passwordBlockAirDropSharing":  false,
    "softwareUpdatesEnforcedDelayInDays":  null,
    "updateDelayPolicy":  null,
    "contentCachingBlocked":  false,
    "iCloudBlockPhotoLibrary":  false,
    "screenCaptureBlocked":  false,
    "classroomAppBlockRemoteScreenObservation":  false,
    "classroomAppForceUnpromptedScreenObservation":  false,
    "classroomForceAutomaticallyJoinClasses":  false,
    "classroomForceRequestPermissionToLeaveClasses":  false,
    "classroomForceUnpromptedAppAndDeviceLock":  false,
    "iCloudBlockActivityContinuation":  false,
    "addingGameCenterFriendsBlocked":  false,
    "gameCenterBlocked":  false,
    "multiplayerGamingBlocked":  false,
    "wallpaperModificationBlocked":  false,
    "eraseContentAndSettingsBlocked":  false,
    "softwareUpdateMajorOSDeferredInstallDelayInDays":  null,
    "softwareUpdateMinorOSDeferredInstallDelayInDays":  null,
    "softwareUpdateNonOSDeferredInstallDelayInDays":  null,
    "touchIdTimeoutInHours":  null,
    "iCloudPrivateRelayBlocked":  false,
    "iCloudDesktopAndDocumentsBlocked":  false,
    "compliantAppsList":  [

                          ],
    "privacyAccessControls":  [

                              ]
}
