{
  "@odata.type": "#microsoft.graph.windowsDeliveryOptimizationConfiguration",
  "id": "74bda9c7-ed5a-46a1-b2d4-8d98c48635b4",
  "lastModifiedDateTime": "2022-09-22T12:23:17.3758991Z",
  "roleScopeTagIds": ["0"],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime": "2022-09-22T12:08:55.3215089Z",
  "description": null,
  "displayName": "Win10 - System - Update",
  "version": 2,
  "deliveryOptimizationMode": "httpWithPeeringNat",
  "restrictPeerSelectionBy": "subnetMask",
  "groupIdSource": null,
  "backgroundDownloadFromHttpDelayInSeconds": 60,
  "foregroundDownloadFromHttpDelayInSeconds": 60,
  "minimumRamAllowedToPeerInGigabytes": 4,
  "minimumDiskSizeAllowedToPeerInGigabytes": 32,
  "minimumFileSizeToCacheInMegabytes": 10,
  "minimumBatteryPercentageAllowedToUpload": 60,
  "modifyCacheLocation": null,
  "maximumCacheAgeInDays": 15,
  "vpnPeerCaching": "disabled",
  "cacheServerHostNames": [],
  "cacheServerForegroundDownloadFallbackToHttpDelayInSeconds": 0,
  "cacheServerBackgroundDownloadFallbackToHttpDelayInSeconds": 0,
  "bandwidthMode": {
    "@odata.type": "#microsoft.graph.deliveryOptimizationBandwidthPercentage",
    "maximumBackgroundBandwidthPercentage": 25,
    "maximumForegroundBandwidthPercentage": 60
  },
  "maximumCacheSize": {
    "@odata.type": "#microsoft.graph.deliveryOptimizationMaxCacheSizePercentage",
    "maximumCacheSizePercentage": 10
  }
}
