{
    "@odata.type":  "#microsoft.graph.windowsIdentityProtectionConfiguration",
    "id":  "fe3f803a-8d33-483c-953e-418ad82cdcbc",
    "lastModifiedDateTime":  "2022-09-27T08:39:09.8640484Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2022-09-22T12:08:54.7767032Z",
    "description":  null,
    "displayName":  "Win10 - System - Hello Entreprise",
    "version":  4,
    "useSecurityKeyForSignin":  true,
    "enhancedAntiSpoofingForFacialFeaturesEnabled":  false,
    "pinMinimumLength":  null,
    "pinMaximumLength":  null,
    "pinUppercaseCharactersUsage":  "notConfigured",
    "pinLowercaseCharactersUsage":  "notConfigured",
    "pinSpecialCharactersUsage":  "notConfigured",
    "pinExpirationInDays":  null,
    "pinPreviousBlockCount":  null,
    "pinRecoveryEnabled":  false,
    "securityDeviceRequired":  false,
    "unlockWithBiometricsEnabled":  true,
    "useCertificatesForOnPremisesAuthEnabled":  false,
    "windowsHelloForBusinessBlocked":  false
}
