{
    "definition@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('eee38118-0408-432d-b81c-632cc4f62f1a')",
    "enabled":  "true",
    "presentationValues":  [
                               {
                                   "@odata.type":  "#microsoft.graph.groupPolicyPresentationValueList",
                                   "values":  [
                                                  {
                                                      "name":  "https://fernandezfrance.sharepoint.com",
                                                      "value":  "2"
                                                  }
                                              ],
                                   "presentation@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('eee38118-0408-432d-b81c-632cc4f62f1a')/presentations('4ad68ed4-b140-4390-849c-7a9b78212f7d')"
                               }
                           ]
}
