{
    "definition@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('f2e9d965-39e3-4efa-8d25-e11e8ff5ef57')",
    "enabled":  "true",
    "presentationValues":  [
                               {
                                   "@odata.type":  "#microsoft.graph.groupPolicyPresentationValueList",
                                   "values":  [
                                                  {
                                                      "name":  "Ressources Harden",
                                                      "value":  "tenantId=a4755b03%2Deb06%2D4ba6%2D977c%2D756caf25aff1\u0026siteId=%7Bbe201df7%2D69e5%2D4681%2Daea5%2Dc36320ecc2c3%7D\u0026webId=%7B9d8441c2%2D5732%2D470f%2Dab0b%2D770d72fd07bf%7D\u0026listId=%7BA316B901%2D48F2%2D4E40%2D97AC%2DDAE9783FA4C4%7D\u0026folderId=c46a0567%2Dcf11%2D4e53%2Da1cc%2Da89a9846ad35\u0026webUrl=https%3A%2F%2Ffernandezfrance%2Esharepoint%2Ecom%2Fsites%2FHarden365\u0026version=1"
                                                  }
                                              ],
                                   "presentation@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('f2e9d965-39e3-4efa-8d25-e11e8ff5ef57')/presentations('4632a9d0-f813-4b3f-9584-11704e50090c')"
                               }
                           ]
}
