{
    "displayName":  "HardenMAC - FileVault",
    "description":  "",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateDisplayName":  "FileVault",
    "TemplateId":  "a239407c-698d-4ef8-b314-e3ae409204b8",
    "versionInfo":  "2007",
    "settingsDelta":  [
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementCollectionSettingInstance",
                              "id":  "6cf05a81-7108-4555-b448-489191df44ff",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultSelectedRecoveryKeyTypes",
                              "valueJson":  "[\"personalRecoveryKey\"]"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "2e5d8aeb-a966-4d1a-b5ae-99b0e4da03a6",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultNumberOfTimesUserCanIgnore",
                              "valueJson":  "1",
                              "value":  1
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "fe7607e6-0ccc-4edc-8787-386f59672825",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultPersonalRecoveryKeyRotationInMonths",
                              "valueJson":  "1",
                              "value":  1
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "65ca67fe-bebe-4fa0-8d94-c955180bc9c3",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultEnabled",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "a2ce54de-61d9-4604-b2df-600ce04ca6df",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultPersonalRecoveryKeyHelpMessage",
                              "valueJson":  "\"https://portal.manage.microsoft.com/\"",
                              "value":  "https://portal.manage.microsoft.com/"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "b131d820-c958-44d5-a887-945727b37d37",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultAllowDeferralUntilSignOut",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "47894451-659f-45ad-8f03-a717698aa102",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultDisablePromptAtSignOut",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "0354a8dd-d5f8-4336-88ed-097375e6fa55",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultHidePersonalRecoveryKey",
                              "valueJson":  "false",
                              "value":  false
                          }
                      ]
}
