{
    "displayName":  "Harden365 - Attack Surface Reduction",
    "description":  "Harden365 - Attack Surface Reduction v1.0",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateDisplayName":  "Attack surface reduction rules",
    "TemplateId":  "0e237410-1367-4844-bd7f-15fb0f08943b",
    "versionInfo":  "2009",
    "settingsDelta":  [
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "b1b8af2c-6458-4a58-9603-589e3e94475a",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderBlockPersistenceThroughWmiType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8e53711a-534d-4d80-bcb9-7ae96eea6e50",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPreventCredentialStealingType",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "7902144f-cfad-4986-86b6-ba8a7dd00442",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdobeReaderLaunchChildProcess",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8ba589a6-a8c6-4eea-98b4-95bff89df956",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjectionType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "d448c061-07f9-486d-8612-f8e2fac9d4b1",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunchType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "e291258d-9582-4899-8031-1819b251ad5f",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcessType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "9d6fabf2-7f99-43db-b157-7dad7f85f947",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32ImportsType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "ffaa2892-cada-49a3-b279-2d65ef5db737",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeCommunicationAppsLaunchChildProcess",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "55543ecc-634e-47a4-809b-9328a3957b9f",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCodeType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "bd303f04-45d6-440e-bad8-59663ad4d06c",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecutionType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "b0d05541-57fd-4b28-bb1c-0fadf6738228",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderProcessCreationType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "2c419ace-3370-40d9-9074-a74072561b49",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcessType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "4c6a2ff0-3639-48b0-846e-3c71807f52ef",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedExecutableType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6684f997-e565-437a-8eea-0580fc60756f",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecutionType",
                              "valueJson":  "\"block\"",
                              "value":  "block"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "691f34f8-6a4d-4390-8ee6-43b534c2a37d",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdvancedRansomewareProtectionType",
                              "valueJson":  "\"enable\"",
                              "value":  "enable"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f996258e-887d-4291-bfb7-c5a56c77b073",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderGuardMyFoldersType",
                              "valueJson":  "\"auditMode\"",
                              "value":  "auditMode"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementCollectionSettingInstance",
                              "id":  "dffa50a3-00f7-4ee9-aa78-a123b0e4e85a",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdditionalGuardedFolders",
                              "valueJson":  "null"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementCollectionSettingInstance",
                              "id":  "6dd85105-4f93-4000-bcaf-9a526214ac79",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderGuardedFoldersAllowedAppPaths",
                              "valueJson":  "null"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementCollectionSettingInstance",
                              "id":  "75ad1af5-7ab3-430e-a8e3-17de13128911",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAttackSurfaceReductionExcludedPaths",
                              "valueJson":  "null"
                          }
                      ]
}
