{
    "displayName":  "Harden365 - Credential Guard",
    "description":  "",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateDisplayName":  "Account protection (Preview)",
    "TemplateId":  "0f2b5d70-d4e9-4156-8c16-1397eb6c54a5",
    "versionInfo":  "2005",
    "settingsDelta":  [
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "7d030fd2-5d17-4cb8-8170-02e2429559e0",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_windowsHelloForBusinessBlocked",
                              "valueJson":  "null",
                              "value":  null
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "614c7ed8-401c-4c0f-9e47-2e71a00cd02e",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_pinMinimumLength",
                              "valueJson":  "null",
                              "value":  null
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "215c3d5b-060f-4632-bf72-b10469e2d5f8",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_pinMaximumLength",
                              "valueJson":  "null",
                              "value":  null
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "8eedc19c-c457-4ccd-bb43-c9f38cd0513e",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_pinLowercaseCharactersUsage",
                              "valueJson":  "\"notConfigured\"",
                              "value":  "notConfigured"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "49315619-e530-46d9-8dcc-cf1f532b851d",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_pinUppercaseCharactersUsage",
                              "valueJson":  "\"notConfigured\"",
                              "value":  "notConfigured"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "f990a097-c588-417d-8c00-c0fa9e9cfbd3",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_pinSpecialCharactersUsage",
                              "valueJson":  "\"notConfigured\"",
                              "value":  "notConfigured"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "ea905900-45ea-408b-b61b-68aa85854c16",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_pinExpirationInDays",
                              "valueJson":  "null",
                              "value":  null
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "e1249c80-3ab8-4ee9-a5a9-6f81cba8fa75",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_pinPreviousBlockCount",
                              "valueJson":  "null",
                              "value":  null
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "637eea44-6479-4954-a21c-40f7a3655836",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_pinRecoveryEnabled",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "f4a6005d-56d5-4c9b-9869-168a83e8c3db",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_securityDeviceRequired",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "a5477592-995c-4e41-89e1-22c7ed63c426",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_unlockWithBiometricsEnabled",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "2b080f1b-77ea-4fb4-9ed8-30082676ff9d",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_enhancedAntiSpoofingForFacialFeaturesEnabled",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "fa4781a7-df03-4e84-b68c-b541921b9c37",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_useCertificatesForOnPremisesAuthEnabled",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "3ecd5305-c828-4604-8518-ef6a8817ad5a",
                              "definitionId":  "deviceConfiguration--windowsIdentityProtectionConfiguration_useSecurityKeyForSignin",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "920eea61-0987-470d-b2e0-f126b0f0c03e",
                              "definitionId":  "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
                              "valueJson":  "\"enableWithoutUEFILock\"",
                              "value":  "enableWithoutUEFILock"
                          }
                      ]
}
