{
    "displayName":  "MacOS - FileVault",
    "description":  "",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateDisplayName":  "FileVault",
    "TemplateId":  "a239407c-698d-4ef8-b314-e3ae409204b8",
    "versionInfo":  "2007",
    "settingsDelta":  [
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementCollectionSettingInstance",
                              "id":  "5a9c729f-50ab-44f5-a3dc-c019497250d3",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultSelectedRecoveryKeyTypes",
                              "valueJson":  "[\"personalRecoveryKey\"]"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "771f1749-bddb-4aa4-aa08-71dee74edf85",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultNumberOfTimesUserCanIgnore",
                              "valueJson":  "1",
                              "value":  1
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementIntegerSettingInstance",
                              "id":  "43340f5c-9698-4dde-a854-5bb6f35570b0",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultPersonalRecoveryKeyRotationInMonths",
                              "valueJson":  "1",
                              "value":  1
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "425559ac-13cc-4b41-8e57-7ae452339916",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultEnabled",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementStringSettingInstance",
                              "id":  "6359d5fa-4482-4868-85c1-ec70cd14487b",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultPersonalRecoveryKeyHelpMessage",
                              "valueJson":  "\"https://portal.manage.microsoft.com/\"",
                              "value":  "https://portal.manage.microsoft.com/"
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "5b3ae4af-6917-4598-ac57-c021b759de0c",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultAllowDeferralUntilSignOut",
                              "valueJson":  "true",
                              "value":  true
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "6a8ffd6f-0e64-468c-b283-0ec33b74eb7c",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultDisablePromptAtSignOut",
                              "valueJson":  "false",
                              "value":  false
                          },
                          {
                              "@odata.type":  "#microsoft.graph.deviceManagementBooleanSettingInstance",
                              "id":  "3cce0e55-43fc-44a3-9afa-ba36dcf7edeb",
                              "definitionId":  "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultHidePersonalRecoveryKey",
                              "valueJson":  "false",
                              "value":  false
                          }
                      ]
}
