{
    "name":  "Harden365 - Defender for Endpoint",
    "description":  "Harden365 - Defender for Endpoint v1.0",
    "platforms":  "windows10",
    "technologies":  "mdm,microsoftSense",
    "templateReference":  {
                              "templateId":  "0385b795-0f2f-44ac-8602-9f65bf6adede_1"
                          },
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "e2f0eec9-9d78-4481-b3a1-91fc3637da7f"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "96c6a02a-0a05-4555-ba3a-751e185c160f",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "a4725204-f47d-4ed7-bda3-436fa404fa28"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency_2",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "a33f3f7d-65fa-4a95-b8a9-7de986f0b62b",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     }
                 ]
}
